КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/КонтурЛогистика_ПЭ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЭ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭксп</name>
    <comment>Уникальный идентификатор документа (УИД) электронного поручения экпедитору, Выдается государственной информационной системой электронных перевозочных документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭкспОтз</name>
    <comment>УИД отозванного электронного поручения экспедитору, вместо которого сформировано данное электронное поручение экспедитору</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДок</name>
    <comment>Дата выдачи поручения экспедитору</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвКлиент</name>
    <comment>Сведения о клиенте - заказчике экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЭксп</name>
    <comment>Сведения об экспедиторе</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДогТрЭксп</name>
    <comment>Реквизиты договора транспортной экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1с</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНаимДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНомерДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДатаДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительШаблона</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийРедактированияШаблона</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииРедактированияШаблона</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящийШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументШаблон</name>
    <comment>Ссылка на документ шаблон, по которому было создано поручение</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвГруз</name>
    <attributes>
      <name>ПЭ_СвГруз</name>
      <type>
        <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Предназначено для обмена информацией не предусмотренной форматом</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИныеДанныеКлт</name>
    <attributes>
      <name>ДанныеИОговорки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопрДок</name>
    <attributes>
      <name>РеквНаимДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквНомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвПредЗак</name>
    <comment>Указывается в случае, если клиент в свою очередь выступает организатором выполнения услуг, связанных с организацией перевозки груза, определенных договором транспортной экспедиции, заключенным с предшествующим заказчиком услуг</comment>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснованияМаршрутов</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_Сценарии/КонтурЛогистика_Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_Сценарии</name>
  <enumValues>
    <name>Отправка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаСогласованногоКладовщиком_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновик_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновикаВодителю_СогласованиеКладовщик_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаЧерновика_ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_Обработка_ОтправкаЧерновика</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЧерновика_ОтправкаПодписанного</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаНеОбрабатывать</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаШаблона</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПараметрыШаблонаПоПризнаку();
	
	ДополнительныеСвойства.Вставить("ЭтоНовыйДокумент", Не ЗначениеЗаполнено(Ссылка));
	
	Если Отказ = Ложь И Не ДополнительныеСвойства.Свойство("ЭтоПропускДокумента") Тогда
		Попытка
			КонтурЛогистика_ОбработкаДокументовСервер.ПропускЗадачЭкспедиторскойЦепочки_ПЭ(ЭтотОбъект);
		Исключение
			ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
			ТекстОшибки = "Ошибка при пропуске задач экспедиторской цепочки. Ошибка: "
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, Ссылка, ТекстОшибки);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовыйДокумент Тогда
		
		Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик;
		РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, Статус, Истина, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Титул")
		И ДанныеЗаполнения.Свойство("Скопировать")
		И ДанныеЗаполнения.Скопировать Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Титул);
		Для Каждого ТЧ Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
			Для Каждого Стр Из ДанныеЗаполнения.Титул[ТЧ.Имя] Цикл
				НоваяСтрока = ЭтотОбъект[ТЧ.Имя].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			КонецЦикла;
		КонецЦикла;

		Номер = "";
		Дата = ТекущаяДатаСеанса();
		ДатаДок = ТекущаяДатаСеанса();
		УИД_ПорЭксп = "";
		УИД_ПорЭкспОтз = "";
		kl_id = "";
		КонтурЛогистика_ОбработкаДокументовСервер.ДобавитьНомерКопииКНомеруДокумента(
			НомДок, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1);

	ИначеЕсли ДанныеЗаполнения <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) Тогда
		
		УстановитьЗначениеЭтоШаблон(ДанныеЗаполнения.ДокументОснование);
		ЗаполнитьОсновныеРеквизитыПоДокОснованию(ДанныеЗаполнения);
		
	ИначеЕсли ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("МассивПартий")
		И ЗначениеЗаполнено(ДанныеЗаполнения.МассивПартий) Тогда
		
		ПерваяПартия = ДанныеЗаполнения.МассивПартий[0];
		
		ЗаполнитьПоПартии(ПерваяПартия);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		// Идентификатор в Логистике
		kl_id = ФайлСсылка.kl_id;
		
		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		ЭтоВходящийШаблон = ЗначениеЗаполнено(ФайлСсылка.ОтправительШаблона);
		
		Если ЭтоВходящийШаблон Тогда
			СценарийРедактированияШаблона = Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.Десериализовать(
				ФайлСсылка.EditingSettingId, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1);
		КонецЕсли;
		
		Если Не ЭтоВходящийШаблон тогда
			ДокументШаблон = КонтурЛогистика_ОбработкаДокументовСервер.УчестьРаботуСШаблонами(ФайлСсылка, "pe");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтоВходящийШаблон Тогда 
		Пользователь1с = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
		ЗаполнитьРеквизитыПоПользователю(Пользователь1с);
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЭ_Титул1_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = ТекущаяДатаСеанса();
	УИД_ПорЭксп = "";
	УИД_ПорЭкспОтз = "";
	kl_id = "";

КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизитыПоДокОснованию(Знач ДанныеЗаполнения)
	
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	
	РазделительИзДанных = Неопределено;
	Если ДанныеЗаполнения.Свойство("Разделитель", РазделительИзДанных) Тогда
		Разделитель = РазделительИзДанных;
	КонецЕсли;
	
	Перезаполнить = ДанныеЗаполнения.Свойство("Перезаполнить") Или Не ЗначениеЗаполнено(Ссылка);
	
	Если Перезаполнить Тогда
		ДокументыОснованияМаршрутов.Очистить();
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		    Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1, ДокументОснование);
	
	// Заполнить ЭтотТитул
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
	РезультатПоиска = КонтурЛогистика_ОбработкаДокументовСервер.СформироватьДокументПЭ(ЭтотОбъект, Перезаполнить);
	
	ДанныеЗаполнения.Вставить("МассивПартий", РезультатПоиска.ПЭПартии);
		
	ЗаполнитьДефолты();
	ЗаполнитьОтправителяШаблонаПоЭкспедитору();
	
КонецПроцедуры

Процедура ЗаполнитьПоПартии(Партия)
	
	// Определим настройку конвертации
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1, Партия.ДокументОснование);
		
	Если КонтекстНастройкиКонвертации.ЕстьНастройкаКонвертации Тогда
		Переменные = КонтурЛогистика_КонвертацияСервер.ДвижокКонвертации_ВычислитьПеременные(
			ЭтотОбъект, Партия.ДокументОснование, КонтекстНастройкиКонвертации.НастройкаКонвертации, "");
	Иначе
		Переменные = Неопределено;
	КонецЕсли;
	
	// Заполним главный по настройке
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(
		ЭтотОбъект, Партия.ДокументОснование, КонтекстНастройкиКонвертации, Переменные);
		
	Если Не ЗначениеЗаполнено(НомДок) Тогда
		НомДок = Партия.НомДок;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаДок) Тогда
		ДатаДок = Партия.ДатаДок;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвКлиент) Тогда
		СвКлиент = Партия.СвКлт;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СвЭксп) Тогда
		СвЭксп = Партия.СвЭксп;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДогТрЭксп) Тогда
		ДогТрЭксп = Партия.ДогТрЭксп;
	КонецЕсли;
	
	ЗаполнитьДефолты();
	
КонецПроцедуры

Процедура ЗаполнитьДефолты()
	
	Если Не ЗначениеЗаполнено(СвЭксп) Тогда 
		
		СвЭкспУмолчание = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ЭкспедиторПоУмолчанию"); 
		Если ЗначениеЗаполнено(СвЭкспУмолчание) Тогда
			СвЭксп = СвЭкспУмолчание;
		Иначе
			// может быть в базе только 1 экспедитор?
			НастроенныеЭкспедиторы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.НастроенныеЭкспедиторы();
			Если НастроенныеЭкспедиторы.Количество() = 1 Тогда 
				СвЭксп = НастроенныеЭкспедиторы[0];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДогТрЭксп) Тогда 
		
		ДогТрЭкспУмолчание = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ДоговорЭкспедицииПоУмолчанию"); 
		Если ЗначениеЗаполнено(ДогТрЭкспУмолчание) Тогда
			ДогТрЭксп = ДогТрЭкспУмолчание;
	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПоПользователю(ВходящийПользователь1С = Неопределено) Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания)  Тогда
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				СвКлиент, , , ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда
			Если ВходящийПользователь1С = Неопределено Тогда
				ПользовательПодписант = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
			Иначе
				ПользовательПодписант = ВходящийПользователь1С;	
			КонецЕсли;	 
		КонецЕсли;
		
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку( "ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьЗначениеЭтоШаблон(ДокументОснование)
	
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1;
		
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		    ТипЛогистика, ДокументОснование);
		    
		Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
			ЭтоШаблон = (КонтекстНастройкиКонвертации.Сценарий = Перечисления.КонтурЛогистика_Сценарии.ОтправкаШаблона); 
		КонецЕсли;
		
		УстановитьОтправителяШаблонаПоПризнаку(ДокументОснование, КонтекстНастройкиКонвертации.НастройкаКонвертации);
	
КонецПроцедуры

Процедура УстановитьОтправителяШаблонаПоПризнаку(ДокументУчетнойСистемы, Знач НастройкаКонвертации)
	
	Если ЭтоШаблон Тогда
		
		Если Не ЗначениеЗаполнено(СценарийРедактированияШаблона) Тогда
			СценарийРедактированияШаблона = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
				"ПЭ_ТипШаблонаДляОтправкиКонтрагенту");
		КонецЕсли;
		
		// Сначала заполняем реквизиты (в т.ч. СвЭксп), затем отправителя шаблона.
		КонтурЛогистика_КонвертацияСервер.ЗаполнитьГлавныйДокументПоДокументуУчетнойСистемы(
			ЭтотОбъект, ДокументУчетнойСистемы, НастройкаКонвертации);
		
	Иначе
		
		ОтправительШаблона = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
		СценарийРедактированияШаблона = Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтправителяШаблонаПоЭкспедитору()
	
	Если ЭтоШаблон
		И Не ЗначениеЗаполнено(ОтправительШаблона)
		И ЗначениеЗаполнено(СвЭксп) Тогда
		ОтправительШаблона = СвЭксп;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	Если ПараметрыФайлаРеквизиты = Неопределено Тогда
		ПараметрыФайлаРеквизиты = Новый Структура;
	КонецЕсли;
	Если ЭтоШаблон Тогда
		ПараметрыФайлаРеквизиты.Вставить("ТребуетсяПодпись", Ложь);
	Иначе
		Если Не ПараметрыФайлаРеквизиты.Свойство("ТребуетсяПодпись") Тогда
			ПараметрыФайлаРеквизиты.Вставить("ТребуетсяПодпись", Истина);
		КонецЕсли;
	КонецЕсли;
	Если ЭтоВходящийШаблон Тогда
		ФайлШаблона = Справочники.КонтурЛогистика_ФайлыОбмена.ПервыйФайлДокумента(Ссылка);
		ПараметрыФайлаРеквизиты.Вставить("ШаблонОснование", ФайлШаблона);
	КонецЕсли;	
	
	ДополнительныеДанныеПроверки = Новый Структура("ТребуетсяПодпись", ПараметрыФайлаРеквизиты.ТребуетсяПодпись);
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЭ_Титул1.ПроверитьДокумент(Ссылка, , ДополнительныеДанныеПроверки);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	ДатИнфКлт = ТекущаяДатаСеанса();
	ВрИнфКлт = ТекущаяДатаСеанса();
	
	Попытка
		
		// формируем текст xml
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфКлт, ВрИнфКлт);
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЭ_Титул1,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);	
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
	
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить(ТекстОшибки);
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
// оставлен механизм преобразования шаблона в документ TransformTemplateToMessage	
//	Если Результат.Успешно И ЭтоВходящийШаблон Тогда 
//		ТекущийСтатусДокументооборота = РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.ПолучитьСтатус(Ссылка).Код;
//		Если ТекущийСтатусДокументооборота = "pe-templateReceived" Тогда
//			РезультатПреобразования = ПреобразоватьШаблонВДокумент(РезультатСозданияФайла.Файл);
//			РегистрыСведений.КонтурЛогистика_ДвижениеДокументооборота.УстановитьСостояние(Ссылка, "pe-templateConverted");
//			Если РезультатПреобразования.Успешно = Ложь Тогда
//				РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка,
//							 , Истина); 
//			КонецЕсли;	
//		КонецЕсли;	 
//	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции 

Функция ПреобразоватьШаблонВДокумент(ФайлОбмена)

	РезультатТранспорта = КонтурЛогистика_API_Диадок.ВыполнитьЗапросСозданияДокументаИзШаблона(ФайлОбмена);
	Если РезультатТранспорта.Успешно Тогда
		Если РезультатТранспорта.РезультатОтправки.Свойство("Message") Тогда
			ФайлОбменаОбъект = ФайлОбмена.ПолучитьОбъект();
			ФайлОбменаОбъект.ДатаЭДО = КонтурЛогистика_ИнтеграцияДиадокСерверПовтИсп.Ядро().Ticks_2_Date(РезультатТранспорта.РезультатОтправки.Message.TimestampTicks);
			ФайлОбменаОбъект.DocumentId = ФайлОбмена.ШаблонОснование.DocumentId;
			ФайлОбменаОбъект.MessageId = РезультатТранспорта.РезультатОтправки.Message.MessageId;
			ФайлОбменаОбъект.ПодписьВерна = Ложь;
			ФайлОбменаОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатТранспорта;

КонецФункции	

Процедура ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
	Если XDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлДокумент = КС.XDTO_Вычислить(XDTO, "Документ");
	Если ЭлДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РеквНаимДок_ОснДовОргСост",  "ОснДовОргСост.РеквНаимДок",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РеквНомерДок_ОснДовОргСост",  "ОснДовОргСост.ОснДовОргСост.",  "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "РеквДатаДок_ОснДовОргСост",  "ОснДовОргСост.РеквДатаДок",  "ДатаТип");
	КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, ЭлДокумент, ЭтотОбъект);

	СодИнфКлт = КС.XDTO_Вычислить(ЭлДокумент, "СодИнфКлнт");
	Если СодИнфКлт = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ИдентификаторыУчастниковЭДО = КС.ИдентификаторыСторонИзИмениФайлаТитула(
		ФайлСсылка.ИмяФайла, КС.XDTO_ПолучитьЗначениеСвойства(XDTO, "ИдФайл"));
	
	МассивЭлементов = Новый Массив;
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "НомДок", "НомДок", "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ДатаДок", "ДатаДок", "ДатаТип");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "УИД_ПорЭксп", "УИД_ПорЭксп", "");
	КС.ДобавитьСтрокуСоответствия(МассивЭлементов, "ДогТрЭксп", "ДогТрЭксп", "РеквДокТип");
	КС.ЗаполнитьДокументыПоМассивуСоответствий(МассивЭлементов, СодИнфКлт, ЭтотОбъект);
	
	СвКлиент = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		КС.XDTO_Вычислить(СодИнфКлт, "СвКлнт"), ИдентификаторыУчастниковЭДО.Клиент, Истина);
	СвЭксп = КС.Конвертировать_РекИдентГО_вОрганизациюДиадок(
		КС.XDTO_Вычислить(СодИнфКлт, "СвЭксп"), ИдентификаторыУчастниковЭДО.Экспедитор, Истина);
	
	ЗаполнитьИныеДанКлнт(СодИнфКлт);
	КС.ЗаполнитьРеквДокТип(СодИнфКлт, "СопрДок", ЭтотОбъект);
	
	КС.ЗаполнитьИнфПолИзXDTO(СодИнфКлт, ЭтотОбъект, "ИнфПол");
	
КонецПроцедуры

Процедура ЗаполнитьИныеДанКлнт(СодИнфКлт)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ИныеДанКлт = КС.XDTO_Вычислить(СодИнфКлт, "ИныеДанКлнт");
	ИныеДанКлт = КС.XDTO_ВычислитьМассивXDTO(ИныеДанКлт);
	Для Каждого ИныеДанные Из ИныеДанКлт Цикл 
		НоваяСтрока = ИныеДанныеКлт.Добавить();
		НоваяСтрока.ДанныеИОговорки = ИныеДанные; 
	КонецЦикла;
	
КонецПроцедуры	

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	Формат = "5.01";
	ТипДокументооборота = "__PE";
	ТипКодировки = "utf-8";
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(1, , ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	W = Число(ДополнительныеПолучателиФайла.Количество() > 0);
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЭ(СвЭксп, СвКлиент, W, GUID); 

	Результат.Вставить("ИдФайл", XDTO_Файл.ИдФайл);
	
	Документ = КС.XDTO_Документ(1, ТипДокументооборота);
	Документ.КНД = Документы.КонтурЛогистика_ПЭ_Титул1.КНД();
	Документ.НаимДок = Документы.КонтурЛогистика_ПЭ_Титул1.НаимДок();
	Документ.ДатИнфКлнт = КС.XDTO_ДатаТип(ДатаФормирования);
	Документ.ВрИнфКлнт = КС.XDTO_ВремяТип(ВремяФормирования);
	
	КС.XDTO_Установить(Документ, "НаимЭкСубСост", НаимЭкСубСост);
	Установить_ОснДовОргСост(Документ);
		
	КС.XDTO_Установить(Документ, "СодИнфКлнт", СодИнфКлнт(ТипДокументооборота));
	
	Если Не ЭтоШаблон Тогда 

		ПодписантСтруктура = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
			СвКлиент, ПользовательПодписант, ДатаФормирования, ЭтотОбъект);
		XDTO_Подписант = КС.XDTO_Подписант_ПЭ(ПодписантСтруктура, 1); // TODO МЧД
		КС.XDTO_Установить(Документ, "ПодпИнфКлнт", XDTO_Подписант);
		
		Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
			Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
		КонецЕсли;
	
	КонецЕсли;
	
	КС.XDTO_Установить(XDTO_Файл, "Документ", Документ);
	
	ТекстФайла = КС.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат, ТипКодировки);
	
	Результат.Вставить("ТекстФайла", ТекстФайла);
	Результат.Вставить("GUID", GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

Процедура Установить_ОснДовОргСост(Документ, ТипДокументооборота = "__PE")
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Если ЗначениеЗаполнено(НаимЭкСубСост) Тогда
		ОснДовОргСост = КС.XDTO_РеквДокТип(1, РеквНаимДок_ОснДовОргСост, РеквНомерДок_ОснДовОргСост,
			РеквДатаДок_ОснДовОргСост, , , , ТипДокументооборота);
		КС.XDTO_Установить(Документ, "ОснДовОргСост", ОснДовОргСост);
	КонецЕсли;	
	
КонецПроцедуры	

Функция СодИнфКлнт(ТипДокументооборота, Формат = "5.01")
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	XDTO_СодИнфКлнт = КС.XDTO_СодИнфКлнт();
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "УИД_ПорЭксп", УИД_ПорЭксп);
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "СодОпер", Документы.КонтурЛогистика_ПЭ_Титул1.СодОпер());
	
	// ИдИсхФайл - Идентификатор исходного файла обмена информации клиента, в который вносится исправление
	// УИД_ПорЭкспОтз
	
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "НомДок", НомДок);
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "ДатаДок", КС.XDTO_ДатаТип(ДатаДок));
	
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "ДокГруз", ?(СопрДок.Количество() = 0, "0", "1")); 
	
	Для Каждого ДанныеИОговорки Из ИныеДанныеКлт Цикл 
		XDTO_СодИнфКлнт.ИныеДанКлт.Добавить(ДанныеИОговорки);   // н 
	КонецЦикла;
	
	Запрос = Документы.КонтурЛогистика_ПЭ_Титул1.ПолучитьЗапросСпискаДокументовМаршрута(Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		XDTO_СвГруз = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СвГруз(Выборка.Ссылка);
		XDTO_СодИнфКлнт.СвГруз.Добавить(XDTO_СвГруз);
	КонецЦикла;
	
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "СвКлнт", КС.XDTO_УчастникТрН(1, Формат, СвКлиент, ТипДокументооборота));
	Если Не ЭтоШаблон Или ЗначениеЗаполнено(СвЭксп) Тогда
		КС.XDTO_Установить(XDTO_СодИнфКлнт, "СвЭксп", КС.XDTO_УчастникТрН(1, Формат, СвЭксп, ТипДокументооборота));
	КонецЕсли;
	// СвПредЗак - не реализовано
	
	XDTO_ДогТрЭксп = КС.XDTO_РеквДокТипПоСсылкеДоговору(1, ДогТрЭксп, ТипДокументооборота); 
	КС.XDTO_Установить(XDTO_СодИнфКлнт, "ДогТрЭксп", XDTO_ДогТрЭксп);
	
	Для Каждого СопроводительныйДокумент Из СопрДок Цикл 
	 	XDTO_СопрДок = КС.XDTO_РеквДокТип_Экспедитор(СопроводительныйДокумент, 1, ТипДокументооборота);
	 	XDTO_СодИнфКлнт.СопрДок.Добавить(XDTO_СопрДок); 
	КонецЦикла;
	
	Для Каждого СтрокаИнфПол Из ИнфПол Цикл
			XDTO_ИнфПол = КС.XDTO_ИнфПол(1, Формат, СтрокаИнфПол, "СодИнфКлнт", ТипДокументооборота);
			XDTO_СодИнфКлнт.ИнфПол.Добавить(XDTO_ИнфПол)
	КонецЦикла;
		
	// ИспрФО - не реализовано
	
	Возврат XDTO_СодИнфКлнт;
	
КонецФункции

Процедура УстановитьПараметрыШаблонаПоПризнаку()
	
	Если ЭтоШаблон Тогда
		
		Если Не ЗначениеЗаполнено(ОтправительШаблона) Тогда
			ОтправительШаблона = СвЭксп;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СценарийРедактированияШаблона) Тогда
			СценарийРедактированияШаблона = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЭ_ТипШаблонаДляОтправкиКонтрагенту");
		КонецЕсли;
		
	Иначе
		
		ОтправительШаблона = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
		
		Если Не ЭтоВходящийШаблон Тогда
			СценарийРедактированияШаблона = Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
